// Generic welcome messages

// Big title : https://patorjk.com/software/taag/#p=display&f=ANSI%20Shadow
// Small title : https://fr.rakko.tools/tools/68/ with 'black_square'

pub fn welcome_message_standard() {
    println!(
        r"
    ██████╗ ██╗   ██╗██╗  ██╗
    ██╔══██╗██║   ██║╚═███╔═╝
    ██║  ██║██║   ██║  ███║ 
    ██████╔╝╚██████╔╝██╔╝ ██╗
    ╚═════╝  ╚═════╝ ╚═╝  ╚═╝
    🆂🆃🅰🅽🅳🅰🆁🅳
"
    );
}

pub fn welcome_message_scalable_worker() {
    println!(
        r"
    ██████╗ ██╗   ██╗██╗  ██╗
    ██╔══██╗██║   ██║╚═███╔═╝
    ██║  ██║██║   ██║  ███║ 
    ██████╔╝╚██████╔╝██╔╝ ██╗
    ╚═════╝  ╚═════╝ ╚═╝  ╚═╝ 
    🆆🅾🆁🅺🅴🆁                                 
"
    );
}
